app/Controllers/usuario_controller.php

    public function formValidation(){
        $input = $this->campo_validacion();
        $formModel = new usuario_Model();

        if(!$input){
            $data['titulo'] ='registrar_usuario';
            echo view('front/head_view',$data);
            echo view('front/navbar_view');
            echo view('back/usuario/registrar_usuario', ['validation' => $this->validator]);
            echo view('front/footer_view');
        }else{
            $formModel->save([
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'usuario' => $this->request->getVar('usuario'),
                'email' => $this->request->getVar('email'),
                'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
            ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Mario', 'Alonso', 'Marioal', 'malonso@gmail.com', '$2y$10$J5wCKvdfQrx0/xbf4mjKP.A7PpKs4TvZZGLgq/bwryVsIiIMYaWQm')

    public function verUsuarios() {
        $usuarioModel = new usuario_Model();
        $data['usuarios'] = $usuarioModel->findAll();
        $data['usuarios'] = $usuarioModel->where('id_bandera', 1)->findAll();
---
SELECT *
FROM `usuarios`
SELECT *
FROM `usuarios`
WHERE `id_bandera` = 1